app/views/quotes/_form.html.erb

    <%= form.label :categories %><br>
    <%= form.collection_check_boxes(:category_ids, Category.all, :id, :catname) %>
---
SELECT "categories".* FROM "categories"