app/views/quotes/_quote.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = ?  [["quote_id", 1]]
---
    <strong>Categories:</strong>
    <% quote.categories.each do |category| %>