app/views/home/index.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = ?  [["quote_id", 2]]
---
    <%# Displays the categories of the  quote that has been written down%>
      <p><strong>Category:</strong> <%= quote.categories.map(&:catname).join(', ') %></p>