app/controllers/home_controller.rb

  def index
    #Retrive the latest 5 quoutes with their corresponding user and philosopher records
    @quotes = Quote.includes(:user, :philosopher).order(created_at: :desc).limit(5)
---
SELECT "quotes".* FROM "quotes" ORDER BY "quotes"."created_at" DESC LIMIT ?  [["LIMIT", 5]]