app/controllers/quotes_controller.rb

SELECT "quotes".* FROM "quotes"
---
  def index
    @quotes = Quote.all.includes(:philosopher, :user)

SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."fname" = ? AND "philosophers"."lname" = ? LIMIT ?  [["fname", "drert"], ["lname", "aertert"], ["LIMIT", 1]]
INSERT INTO "philosophers" ("fname", "lname", "birth_year", "death_year", "biography", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "quotes" ("quote_text", "quote_year", "quote_comment", "ispublic", "user_id", "philosopher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @quote = Quote.new(quote_params)
    #This handles the philosopher data
    philosopher = Philosopher.find_or_initialize_by(fname: params[:philosopher_fname], lname: params[:philosopher_lname])
    philosopher.birth_year = params[:philosopher_birth_year]
    philosopher.death_year = params[:philosopher_death_year]
    philosopher.biography = params[:philosopher_biography]

    # Associate the philosopher with the quote
    @quote.philosopher = philosopher

    respond_to do |format|
      if @quote.save

SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."fname" = ? AND "philosophers"."lname" = ? LIMIT ?  [["fname", ""], ["lname", ""], ["LIMIT", 1]]
UPDATE "quotes" SET "philosopher_id" = ?, "updated_at" = ? WHERE "quotes"."id" = ?  [["philosopher_id", 3], ["updated_at", "2024-10-19 14:55:02.404332"], ["id", 2]]
---
  def update
    @quote = Quote.find(params[:id])

  # This handles the  philosopher data in the update section
    philosopher = Philosopher.find_or_initialize_by(fname: params[:philosopher_fname], lname: params[:philosopher_lname])
    philosopher.birth_year = params[:philosopher_birth_year]
    philosopher.death_year = params[:philosopher_death_year]
    philosopher.biography = params[:philosopher_biography]

   # Associate the philosopher with the quote
    @quote.philosopher = philosopher



    respond_to do |format|
      if @quote.update(quote_params)

DELETE FROM "quotes" WHERE "quotes"."id" = ?  [["id", 1]]
---
  def destroy
    @quote.destroy