app/controllers/sessions_controller.rb

        def create
          user = User.find_by(email: params[:email])#Locates the user by the email
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "rayaali@email.com"], ["LIMIT", 1]]