app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("fname", "lname", "email", "password_digest", "is_admin", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "is_admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["is_admin", 1], ["updated_at", "2024-10-14 12:42:36.432701"], ["id", 1]]